package iryohi;

import java.time.LocalDate;
import java.util.ArrayList;
import java.util.LinkedHashMap;
import java.util.List;
import java.util.Map;
import java.util.Map.Entry;
import java.util.stream.Collectors;

import org.junit.jupiter.api.Test;

public class Test医療費助成申請請求 {

    List<医療費助成申請> list = new ArrayList<>();

    Test医療費助成申請請求() {
        申請();
    }

    void add(String 申請日, String 医療機関, String 受信日, String 診療科, int 金額) {
        list.add(new 医療費助成申請(LocalDate.parse(申請日), 医療機関, LocalDate.parse(受信日),
            診療科, 金額));
    }

    void 申請() {
        String 申請日;
        申請日 = "2018-04-05";
        add(申請日, "上毛病院", "2017-12-20", "精神科", 1210);
        add(申請日, "上毛病院", "2018-01-15", "整形外科", 770);
        add(申請日, "上毛病院", "2018-01-22", "整形外科", 770);
        add(申請日, "上毛病院", "2018-01-31", "精神科", 4970);
        add(申請日, "上毛病院", "2018-02-05", "整形外科", 770);
        add(申請日, "上毛病院", "2018-02-14", "整形外科", 770);
        add(申請日, "上毛病院", "2018-02-14", "歯科", 3330);
        add(申請日, "上毛病院", "2018-02-19", "整形外科", 770);
        add(申請日, "上毛病院", "2018-02-19", "歯科", 610);
        add(申請日, "上毛病院", "2018-02-28", "整形外科", 770);
        add(申請日, "上毛病院", "2018-02-28", "歯科", 580);
        add(申請日, "上毛病院", "2018-03-07", "精神科", 2820);
        add(申請日, "上毛病院", "2018-03-07", "歯科", 3390);
        add(申請日, "上毛病院", "2018-03-12", "整形外科", 770);
        add(申請日, "上毛病院", "2018-03-19", "整形外科", 770);
        add(申請日, "上毛病院", "2018-03-28", "整形外科", 770);
        add(申請日, "上毛病院", "2018-03-28", "歯科", 8990);
        add(申請日, "上毛病院", "2018-04-04", "精神科", 2070);
        add(申請日, "石川内科", "2017-12-20", "", 1750);
        add(申請日, "石川内科", "2018-01-31", "", 1750);
        add(申請日, "石川内科", "2018-03-07", "", 1750);
        add(申請日, "桐生共同薬局", "2017-12-21", "石川内科", 1310);
        add(申請日, "桐生共同薬局", "2018-01-31", "上毛病院", 1410);
        add(申請日, "桐生共同薬局", "2018-01-31", "石川内科", 1310);
        add(申請日, "桐生共同薬局", "2018-03-07", "上毛病院", 770);
        add(申請日, "桐生共同薬局", "2018-03-07", "石川内科", 1310);
        add(申請日, "群馬リハビリ", "2017-12-31", "", 7180);
        add(申請日, "群馬リハビリ", "2018-01-31", "", 5590);
        add(申請日, "群馬リハビリ", "2018-02-28", "", 6380);
        申請日 = "2018-06-02";
        add(申請日, "上毛病院", "2018-04-09", "整形外科", 770);
        add(申請日, "上毛病院", "2018-04-09", "歯科", 5200);
        add(申請日, "上毛病院", "2018-04-16", "整形外科", 770);
        add(申請日, "上毛病院", "2018-04-16", "歯科", 3100);
        add(申請日, "上毛病院", "2018-04-23", "整形外科", 770);
        add(申請日, "上毛病院", "2018-05-01", "整形外科", 770);
        add(申請日, "上毛病院", "2018-05-11", "整形外科", 770);
        add(申請日, "上毛病院", "2018-05-14", "整形外科", 770);
        add(申請日, "上毛病院", "2018-05-14", "歯科", 930);
        add(申請日, "上毛病院", "2018-05-23", "整形外科", 770);
        add(申請日, "上毛病院", "2018-05-30", "歯科", 1020);
        add(申請日, "上毛病院", "2018-05-30", "精神科", 2070);
        add(申請日, "石川内科", "2018-04-13", "", 1750);
        add(申請日, "石川内科", "2018-05-21", "", 2650);
        add(申請日, "桐生共同薬局", "2018-04-13", "石川内科", 1170);
        add(申請日, "桐生共同薬局", "2018-05-21", "石川内科", 1170);
        add(申請日, "群馬リハビリ", "2018-04-06", "", 7180);
        add(申請日, "群馬リハビリ", "2018-05-03", "", 7180);
        申請日 = "2018-09-06";
        add(申請日, "上毛病院", "2018-06-08", "整形外科", 770);
        add(申請日, "上毛病院", "2018-06-08", "歯科", 1640);
        add(申請日, "上毛病院", "2018-06-27", "歯科", 4650);
        add(申請日, "上毛病院", "2018-08-29", "精神科", 1410);
        add(申請日, "石川内科", "2018-06-25", "", 2650);
        add(申請日, "石川内科", "2018-07-30", "", 1750);
        add(申請日, "石川内科", "2018-09-03", "", 4570);
        add(申請日, "桐生共同薬局", "2018-04-04", "上毛病院", 1490);
        add(申請日, "桐生共同薬局", "2018-05-30", "上毛病院", 1910);
        add(申請日, "桐生共同薬局", "2018-06-25", "石川内科", 1130);
        add(申請日, "桐生共同薬局", "2018-07-30", "石川内科", 1310);
        add(申請日, "群馬リハビリ", "2018-06-07", "", 6380);
        add(申請日, "群馬リハビリ", "2018-07-05", "", 9230);
        add(申請日, "群馬リハビリ", "2018-08-03", "", 8210);
        申請日 = "2018-11-15";
        add(申請日, "上毛病院", "2018-10-31", "精神科", 1410);
        add(申請日, "石川内科", "2018-10-09", "", 2360);
        add(申請日, "石川内科", "2018-11-12", "", 1460);
        add(申請日, "桐生共同薬局", "2018-08-29", "上毛病院", 1980);
        add(申請日, "桐生共同薬局", "2018-09-03", "石川内科", 1640);
        add(申請日, "桐生共同薬局", "2018-10-09", "石川内科", 1520);
        add(申請日, "桐生共同薬局", "2018-10-31", "上毛病院", 1120);
        add(申請日, "桐生共同薬局", "2018-11-12", "石川内科", 1380);
        申請日 = "2019-02-07";
        add(申請日, "上毛病院", "2018-12-19", "精神科", 1410);
        add(申請日, "上毛病院", "2019-01-30", "精神科", 1410);
        add(申請日, "石川内科", "2018-12-10", "", 1460);
        add(申請日, "石川内科", "2019-01-21", "", 2360);
        add(申請日, "桐生共同薬局", "2018-12-10", "石川内科", 1380);
        add(申請日, "桐生共同薬局", "2019-01-21", "石川内科", 1340);
        申請日 = "2019-05-02";
        add(申請日, "上毛病院", "2019-03-06", "精神科", 1410);
        add(申請日, "上毛病院", "2019-03-06", "整形外科", 110);
        add(申請日, "上毛病院", "2019-04-17", "精神科", 1410);
        add(申請日, "石川内科", "2019-02-25", "", 1460);
        add(申請日, "石川内科", "2019-03-29", "", 2360);
        add(申請日, "石川内科", "2019-04-26", "", 1460);
        add(申請日, "桐生共同薬局", "2018-11-15", "上毛病院", 1230);
        add(申請日, "桐生共同薬局", "2019-01-30", "上毛病院", 1620);
        add(申請日, "桐生共同薬局", "2019-02-25", "石川内科", 1380);
        add(申請日, "桐生共同薬局", "2019-03-29", "石川内科", 1260);
        add(申請日, "桐生共同薬局", "2019-04-17", "上毛病院", 1670);
        add(申請日, "桐生共同薬局", "2019-04-26", "石川内科", 1540);
        申請日 = "2019-07-25";
        add(申請日, "上毛病院", "2019-05-29", "精神科", 1410);
        add(申請日, "上毛病院", "2019-05-29", "整形外科", 2210);
        add(申請日, "上毛病院", "2019-06-05", "歯科", 3590);
        add(申請日, "上毛病院", "2019-06-05", "整形外科", 370);
        add(申請日, "上毛病院", "2019-06-05", "歯科", 2120);
        add(申請日, "上毛病院", "2019-06-19", "整形外科", 370);
        add(申請日, "上毛病院", "2019-06-19", "歯科", 910);
        add(申請日, "上毛病院", "2019-07-03", "精神科", 1210);
        add(申請日, "石川内科", "2019-05-27", "", 1460);
        add(申請日, "石川内科", "2019-07-01", "", 2360);
        申請日 = "2019-10-31";
        add(申請日, "上毛病院", "2019-07-03", "整形外科", 2610);
        add(申請日, "上毛病院", "2019-08-07", "精神科", 1410);
        add(申請日, "上毛病院", "2019-09-04", "整形外科", 4460);
        add(申請日, "上毛病院", "2019-09-18", "精神科", 1410);
        add(申請日, "上毛病院", "2019-09-18", "整形外科", 2010);
        add(申請日, "石川内科", "2019-08-05", "", 1460);
        add(申請日, "石川内科", "2019-09-09", "", 1460);
        add(申請日, "石川内科", "2019-10-10", "", 1470);
        add(申請日, "桐生協同薬局", "2019-05-27", "石川内科", 1540);
        add(申請日, "桐生協同薬局", "2019-07-01", "石川内科", 1540);
        add(申請日, "桐生協同薬局", "2019-08-05", "石川内科", 1540);
        add(申請日, "桐生協同薬局", "2019-09-09", "石川内科", 1570);
        add(申請日, "桐生協同薬局", "2019-10-10", "石川内科", 1470);
        申請日 = "2019-11-14";
        add(申請日, "石川内科", "2018-06-08", "", 1550);
        add(申請日, "桐生協同薬局", "2018-06-08", "石川内科", 490);
        add(申請日, "桐生協同薬局", "2018-12-19", "上毛病院", 1530);
        add(申請日, "桐生協同薬局", "2019-03-06", "上毛病院", 790);
        add(申請日, "桐生協同薬局", "2019-05-29", "上毛病院", 1210);
        add(申請日, "桐生協同薬局", "2019-08-07", "上毛病院", 970);
        add(申請日, "桐生協同薬局", "2019-09-18", "上毛病院", 1390);
        add(申請日, "上毛病院", "2019-11-06", "精神科", 1410);
        add(申請日, "石川内科", "2019-11-11", "", 2370);
        add(申請日, "桐生協同薬局", "2019-11-11", "石川内科", 1470);
        申請日 = "2020-01-10";
        add(申請日, "上毛病院", "2019-12-04", "整形外科", 380);
        add(申請日, "上毛病院", "2019-12-18", "整形外科", 380);
        add(申請日, "石川内科", "2019-12-16", "", 1470);
        add(申請日, "石川内科", "2020-01-06", "", 1470);
        add(申請日, "桐生協同薬局", "2019-12-16", "石川内科", 1470);
        add(申請日, "桐生協同薬局", "2020-01-06", "石川内科", 3140);
        add(申請日, "じゅん歯科", "2019-12-21", "", 980);
        申請日 = "2020-07-07";
        add(申請日, "上毛病院", "2020-01-15", "精神科", 1410);
        add(申請日, "上毛病院", "2020-02-19", "精神科", 1410);
        add(申請日, "上毛病院", "2020-03-18", "精神科", 1410);
        add(申請日, "上毛病院", "2020-07-01", "精神科", 1410);
        add(申請日, "石川内科", "2020-03-02", "", 2370);
        add(申請日, "石川内科", "2020-04-06", "", 1470);
        add(申請日, "石川内科", "2020-05-11", "", 1470);
        add(申請日, "石川内科", "2020-06-08", "", 1470);
        add(申請日, "桐生協同薬局", "2020-02-20", "上毛病院", 1320);
        add(申請日, "桐生協同薬局", "2020-03-02", "石川内科", 1470);
        add(申請日, "桐生協同薬局", "2020-04-06", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2020-05-11", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2020-06-08", "石川内科", 1480);
        申請日 = "2020-11-10";
        add(申請日, "上毛病院", "2020-08-05", "精神科", 1410);
        add(申請日, "上毛病院", "2020-09-30", "精神科", 1410);
        add(申請日, "上毛病院", "2020-11-04", "精神科", 1410);
        add(申請日, "さくらクリニック", "2020-08-28", "", 1250);
        add(申請日, "石川内科", "2020-07-20", "", 2370);
        add(申請日, "石川内科", "2020-08-31", "", 1470);
        add(申請日, "石川内科", "2020-10-05", "", 2370);
        add(申請日, "石川内科", "2020-11-02", "", 1470);
        add(申請日, "桐生協同薬局", "2019-11-07", "上毛病院", 1560);
        add(申請日, "桐生協同薬局", "2020-01-15", "上毛病院", 1210);
        add(申請日, "桐生協同薬局", "2020-03-18", "上毛病院", 1210);
        add(申請日, "桐生協同薬局", "2020-07-01", "上毛病院", 1340);
        add(申請日, "桐生協同薬局", "2020-07-20", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2020-08-06", "上毛病院", 1210);
        add(申請日, "桐生協同薬局", "2020-08-28", "さくらクリニック", 570);
        add(申請日, "桐生協同薬局", "2020-08-31", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2020-09-30", "上毛病院", 1270);
        add(申請日, "桐生協同薬局", "2020-10-05", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2020-11-02", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2020-11-04", "上毛病院", 1520);
        申請日 = "2021-07-29";
        add(申請日, "上毛病院", "2020-12-02", "精神科", 1410);
        add(申請日, "上毛病院", "2021-01-20", "精神科", 1410);
        add(申請日, "上毛病院", "2021-01-20", "整形外科", 110);
        add(申請日, "上毛病院", "2021-03-17", "精神科", 1410);
        add(申請日, "上毛病院", "2021-03-17", "整形外科", 110);
        add(申請日, "上毛病院", "2021-05-19", "精神科", 1430);
        add(申請日, "上毛病院", "2021-03-17", "歯科", 2970);
        add(申請日, "上毛病院", "2021-06-10", "歯科", 2490);
        add(申請日, "上毛病院", "2021-07-21", "精神科", 1430);
//        add(申請日, "石川内科", "2020-11-13", "内科", 3300); インフルエンザワクチン(保険適用外)
        add(申請日, "石川内科", "2020-12-07", "内科", 2370);
        add(申請日, "石川内科", "2021-01-18", "内科", 1470);
        add(申請日, "石川内科", "2021-02-22", "内科", 1470);
        add(申請日, "石川内科", "2021-03-30", "内科", 2370);
        add(申請日, "石川内科", "2021-05-07", "内科", 1490);
        add(申請日, "石川内科", "2021-06-11", "内科", 1490);
        add(申請日, "石川内科", "2021-07-16", "内科", 2390);
        add(申請日, "桐生協同薬局", "2020-12-02", "上毛病院", 1320);
        add(申請日, "桐生協同薬局", "2020-12-07", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2021-01-18", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2021-01-20", "上毛病院", 1400);
        add(申請日, "桐生協同薬局", "2021-02-24", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2021-03-17", "上毛病院", 1790);
        add(申請日, "桐生協同薬局", "2021-03-30", "石川内科", 1480);
        add(申請日, "桐生協同薬局", "2021-05-07", "石川内科", 1390);
        add(申請日, "桐生協同薬局", "2021-05-19", "上毛病院", 1830);
        add(申請日, "桐生協同薬局", "2021-06-11", "石川内科", 1340);
        add(申請日, "山崎医院", "2021-05-30", "", 2070);
        add(申請日, "わたらせ薬局南店", "2021-05-30", "山崎医院", 550);
        // 補装具修理 (総額14840円 療養費10388円、医療費助成4452円）
        add(申請日, "高崎義肢", "2021-01-22", "", 4452); // 3割分
    }

    @Test
    void test合計() {
        Map<LocalDate, Integer> 合計 = list.stream()
            .collect(Collectors.groupingBy(r -> r.申請日(),
                LinkedHashMap::new,
                Collectors.summingInt(r -> r.金額())));
        for (Entry<LocalDate, Integer> e : 合計.entrySet())
            System.out.println(e);
        /**
         * <pre>
         * 2018-04-05=65410
         * 2018-06-02=38810
         * 2018-09-06=47100
         * 2018-11-15=12870
         * 2019-02-07=9360
         * 2019-05-02=16910
         * 2019-07-25=16010
         * 2019-10-31=23950
         * 2019-11-14=13180
         * 2020-01-10=9290
         * 2020-07-07=19650
         * 2020-11-10=28970
         * 2021-07-29=47882
         * </pre>
         */
    }

}
